Revit 2027 API
WallSweepInfo.IsVertical Property
 Indicates whether the sweep or reveal is swept vertically or horizontally.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsVertical { get; }
Public ReadOnly Property IsVertical As Boolean
	Get
public:
property bool IsVertical {
	bool get ();
}
member IsVertical : bool with get
Property Value
Boolean
Remarks
 Wall sweeps defined as a part of a vertical compound structure will always be horizontal.
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace